region is us-east-2
profile role with admin permission
the tf plan and apply stdout
<details>

```
[STDOUT]   + create
[STDOUT]
[STDOUT] Terraform will perform the following actions:
[STDOUT]
[STDOUT]   # awscc_ecr_repository_creation_template.docker-hub-template will be created
[STDOUT]   + resource "awscc_ecr_repository_creation_template" "docker-hub-template" {
[STDOUT]       + applied_for              = [
[STDOUT]           + "PULL_THROUGH_CACHE",
[STDOUT]         ]
[STDOUT]       + created_at               = (known after apply)
[STDOUT]       + description              = "docker hub cache"
[STDOUT]       + encryption_configuration = (known after apply)
[STDOUT]       + id                       = (known after apply)
[STDOUT]       + image_tag_mutability     = (known after apply)
[STDOUT]       + lifecycle_policy         = (known after apply)
[STDOUT]       + prefix                   = "example"
[STDOUT]       + repository_policy        = jsonencode(
[STDOUT]             {
[STDOUT]               + Statement = [
[STDOUT]                   + {
[STDOUT]                       + Action    = [
[STDOUT]                           + "ecr:BatchGetImage",
[STDOUT]                           + "ecr:GetDownloadUrlForLayer",
[STDOUT]                           + "ecr:BatchImportUpstreamImage",
[STDOUT]                         ]
[STDOUT]                       + Condition = {
[STDOUT]                           + ArnLike = {
[STDOUT]                               + "aws:PrincipalArn" = [
[STDOUT]                                   + "arn:aws:iam::xxx:role/*",
[STDOUT]                                   + "arn:aws:iam::xxx:role/*",
[STDOUT]                                   + "arn:aws:iam::xxx:role/*",
[STDOUT]                                 ]
[STDOUT]                             }
[STDOUT]                         }
[STDOUT]                       + Effect    = "Allow"
[STDOUT]                       + Principal = {
[STDOUT]                           + AWS = "*"
[STDOUT]                         }
[STDOUT]                       + Sid       = "AllowCrossAccountPull"
[STDOUT]                     },
[STDOUT]                 ]
[STDOUT]               + Version   = "2012-10-17"
[STDOUT]             }
[STDOUT]         )
[STDOUT]       + resource_tags            = (known after apply)
[STDOUT]       + updated_at               = (known after apply)
[STDOUT]     }
[STDOUT]
[STDOUT] Plan: 1 to add, 0 to change, 0 to destroy.
[STDOUT] ╷

 ## apply result
[INFO] Component uses Terraform v1.8.5
[STDOUT] Acquiring state lock. This may take a few moments...
[STDOUT] awscc_ecr_repository_creation_template.docker-hub-template: Creating...
[STDERR] ╷
[STDERR] │ Error: AWS SDK Go Service Operation Unsuccessful
[STDERR] │
[STDERR] │   with awscc_ecr_repository_creation_template.docker-hub-template,
[STDERR] │   on ecr-pullthrough.tf line 60, in resource "awscc_ecr_repository_creation_template" "docker-hub-template":
[STDERR] │   60: resource "awscc_ecr_repository_creation_template" "docker-hub-template" {
[STDERR] │
[STDERR] │ Calling Cloud Control API service CreateResource operation returned:
[STDERR] │ operation error CloudControl: CreateResource, https response error
[STDERR] │ StatusCode: 400, RequestID: 327f54a0-2ff1-46a1-a1d0-75943bce7ba5,
[STDERR] │ TypeNotFoundException: The type 'AWS::ECR::RepositoryCreationTemplate'
[STDERR] │ cannot be found.
[STDERR] ╵
[STDOUT] Releasing state lock. This may take a few moments...
```